
#Область ПрограммныйИнтерфейс
// МДК при создании на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  Отказ - Булево - Отказ
//  СтандартнаяОбработка - Булево - Стандартная обработка
&После("ПриСозданииНаСервере")
Процедура МДК_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		НовыйЭлемент = Форма.Элементы.Добавить("ИНН", Тип("ПолеФормы"), Форма.Элементы.ГруппаКонтрагент);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Заголовок = "ИНН";
		НовыйЭлемент.ПутьКДанным = "Объект.Контрагент.ИНН";
		НовыйЭлемент.Ширина = 28; 
		
		НовыйЭлемент = Форма.Элементы.Добавить("НовыйРеквизит", Тип("ПолеФормы"), Форма.Элементы.ГруппаКонтрагент);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Новый реквизит";
		НовыйЭлемент.ПутьКДанным = "Объект.МДК_НовыйРеквизит";
		НовыйЭлемент.Ширина = 28; 
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		
		Элементы = Форма.Элементы;
		НоваяГруппа = Элементы.Вставить("ГруппаКонтрагент", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево, Элементы.Контрагент);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		
		Элементы.Переместить(Элементы.Контрагент, НоваяГруппа);
		
		
		НовыйЭлемент = Форма.Элементы.Добавить("ИНН", Тип("ПолеФормы"), НоваяГруппа);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Заголовок = "ИНН";
		НовыйЭлемент.ПутьКДанным = "Объект.Контрагент.ИНН";
		НовыйЭлемент.Ширина = 28;
		
		НовыйЭлемент = Форма.Элементы.Добавить("МДК_ИНН", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛево);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "ИНН (МДК)";
		НовыйЭлемент.ПутьКДанным = "Объект.МДК_ИНН";
		НовыйЭлемент.Ширина = 28; 
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
